presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Declarative Fence Insertion</title>
<!-- 2015-09-24 Thu 16:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Declarative Fence Insertion</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">A Savage Optimization</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Recipe for PB&amp;J</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">chef 1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">get bread</td>
</tr>

<tr>
<td class="left">apply peanut butter</td>
</tr>

<tr>
<td class="left">apply jelly</td>
</tr>

<tr>
<td class="left">close halves</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Delayed PB? Optimize.</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">chef 1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">get bread</td>
</tr>

<tr>
<td class="left">apply jelly</td>
</tr>

<tr>
<td class="left">! apply peanut butter</td>
</tr>

<tr>
<td class="left">close halves</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Concurrent Failure</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">A Delicate Activity</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">chef 1</th>
<th scope="col" class="left">chef 2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">get bread</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">apply peanut butter</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">apply jelly</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">check jelly</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">close halves</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Delayed PB? Optim— oh.</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">chef 1</th>
<th scope="col" class="left">chef 2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">get bread</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">apply jelly</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">check jelly</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">close halves</td>
</tr>

<tr>
<td class="left">! apply peanut butter</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
