presentation.html

<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8">TL2 STM Algorithm</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">

<pre class="src src-c">...
<span style="color: #ff0000;"># if</span><span style="color: #ff0000;">n</span><span style="color: #ff0000;">def</span> TL2_EAGER
<span style="color: #ff0000;">#   ifdef</span> TL2_OPTIM_HASHLOG
<span style="color: #00cd00;">for</span> (wr = logs; wr != end; wr++)
<span style="color: #ff0000;">#   endif</span>
{
  <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">write the deferred stores</span>
  WriteBackForward(wr);
}
<span style="color: #ff0000;"># endif</span>

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">make stores visible before unlock</span>
MEMBARSTST();

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">release locks and increment version</span>
DropLocks(Self, wv);

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">ensure loads are from global writes</span>
MEMBARSTLD();

<span style="color: #00cd00;">return</span> 1;
...
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9">Fence Macros</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">

<pre class="src src-c">...
<span style="color: #ff0000;"># if</span><span style="color: #ff0000;">n</span><span style="color: #ff0000;">def</span> TL2_EAGER
<span style="color: #ff0000;">#   ifdef</span> TL2_OPTIM_HASHLOG
<span style="color: #00cd00;">for</span> (wr = logs; wr != end; wr++)
<span style="color: #ff0000;">#   endif</span>
{
  <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">write the deferred stores</span>
  WriteBackForward(wr);
}
<span style="color: #ff0000;"># endif</span>

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">make stores visible before unlock</span>
&gt; MEMBARSTST();

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">release locks and increment version</span>
DropLocks(Self, wv);

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">ensure loads are from global writes</span>
&gt; MEMBARSTLD();

<span style="color: #00cd00;">return</span> 1;
...
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10">Loops</h3>
<div class="outline-text-3" id="text-4-10">
<div class="org-src-container">

<pre class="src src-c">...
<span style="color: #ff0000;"># if</span><span style="color: #ff0000;">n</span><span style="color: #ff0000;">def</span> TL2_EAGER
<span style="color: #ff0000;">#   ifdef</span> TL2_OPTIM_HASHLOG
<span style="color: #00cd00;">for</span> (wr = logs; wr != end; wr++)
<span style="color: #ff0000;">#   endif</span>
{
  <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">write the deferred stores</span>
  &gt; WriteBackForward(wr);
  &gt; <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">this might be bad place</span>
}
<span style="color: #ff0000;"># endif</span>

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">make stores visible before unlock</span>
MEMBARSTST();

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">release locks and increment version</span>
DropLocks(Self, wv);

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">ensure loads are from global writes</span>
MEMBARSTLD();

<span style="color: #00cd00;">return</span> 1;
...
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-11" class="outline-3">
<h3 id="sec-4-11">Unnecessary</h3>
<div class="outline-text-3" id="text-4-11">
<div class="org-src-container">

<pre class="src src-c">...
<span style="color: #ff0000;"># if</span><span style="color: #ff0000;">n</span><span style="color: #ff0000;">def</span> TL2_EAGER
<span style="color: #ff0000;">#   ifdef</span> TL2_OPTIM_HASHLOG
<span style="color: #00cd00;">for</span> (wr = logs; wr != end; wr++)
<span style="color: #ff0000;">#   endif</span>
{
  <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">write the deferred stores</span>
  WriteBackForward(wr);
}
<span style="color: #ff0000;"># endif</span>

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">unnecessary ifdef TL2_EAGER</span>
&gt; MEMBARSTST();

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">release locks and increment version</span>
DropLocks(Self, wv);

<span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">ensure loads are from global writes</span>
MEMBARSTLD();

<span style="color: #00cd00;">return</span> 1;
...
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Our Approach</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Order Specifications</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>order: relation between instructions
</li>
<li>account for loops, overlaps, etc
</li>
<li>platform agnostic
</li>
<li>annotation vs inference
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Dekker</h3>
<div class="outline-text-3" id="text-5-2">
<p>
\({st(\mathtt{flag0}) \rightarrow ld(\mathtt{flag1})}\)
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #cdcd00;">bool</span> <span style="color: #0000ee;">p0</span>() {
&gt; flag0 = 1;
|
&gt; <span style="color: #00cd00;">if</span>(flag1 == 1){
    <span style="color: #00cd00;">return</span> <span style="color: #00cdcd;">false</span>;
  }
  <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">!! critical</span>
  <span style="color: #00cd00;">return</span> <span style="color: #00cdcd;">true</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">TL2 STM</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">

<pre class="src src-c">    ...
<span style="color: #ff0000;">    # if</span><span style="color: #ff0000;">n</span><span style="color: #ff0000;">def</span> TL2_EAGER
<span style="color: #ff0000;">    #   ifdef</span> TL2_OPTIM_HASHLOG
    <span style="color: #00cd00;">for</span> (wr = logs; wr != end; wr++)
<span style="color: #ff0000;">    #   endif</span>
    {
      <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">write the deferred stores</span>
  &gt;   WriteBackForward(wr);
  | }
  | # endif
  |
  | <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">unnecessary ifdef TL2_EAGER</span>
  | MEMBARSTST();
  |
  |  <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">release locks and increment version</span>
&gt; &gt; DropLocks(Self, wv);
|
|   <span style="color: #00ffff; font-style: italic;">// </span><span style="color: #00ffff; font-style: italic;">ensure loads are from global writes</span>
|   MEMBARSTLD();
|
&gt;   <span style="color: #00cd00;">return</span> 1;
    ...
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">TL2 STM</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>\({st(\mathtt{addr}) \rightarrow ld(\mathtt{lock_{addr}})}\)
</li>
<li>\({st(\mathtt{lock_{addr}}) \rightarrow ld(*)}\)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5">Value</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>declarative
</li>
<li>exact
</li>
<li>often included
</li>
<li>effective
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Related Work</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Recovering sequential consistency</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Don't Sit on the Fence [Alglave]
</li>
<li>Hiding relaxed memory consistency with a compiler [Lee]
</li>
<li>all, whole program
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Enforcing arbitrary properties</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Automatic inference of memory fences [Kuperstein]
</li>
<li>Synthesis of memory fences via refinement propagation [Meshman]
</li>
<li>all, whole program
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Thanks!</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-09-24 Thu 16:05</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
